app/views/checkins/_create.html.erb

  	<% end %>
    <span style="font-size:12px">&#149;<%= @checkin.created_at.strftime("%b %e, %Y %l:%M %p") %></span><br>
---
INSERT INTO "checkins" ("comment", "created_at", "location_id", "name", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)