app/views/checkins/_form.html.erb

SELECT COUNT(*) FROM "checkins" WHERE "checkins"."location_id" = 2
---

    <% if !@location.checkins.any? %>