app/views/checkins/_show.html.erb

SELECT "checkins".* FROM "checkins" WHERE "checkins"."location_id" = 3
---
  <br>
  <% @location.checkins.each do |f| %>